cases/PR1.2/case/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 288.15;

boundaryField
{
    engineInlet
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 833.33;
        value           uniform 288.15;
    }

    freestreamInlet
    {
        type            fixedValue;
        value           uniform 288.15;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 288.15;
        value           uniform 288.15;
    }

    internalNozzleWall
    {
        type            zeroGradient;
    }

    externalNozzleWall
    {
        type            zeroGradient;
    }

    topSlip
    {
        type            zeroGradient;
    }

    axis
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
