cases/PR1.2/case/Allrun
#!/bin/sh
cd "${0%/*}" || exit 1

blockMesh
foamRun -solver shockFluid
